import {
    Box,
    Container,
    Heading,
    Text,
    useDisclosure,
    SlideFade, // SlideFade is not directly used in the provided code, but kept if you intend to use it.
    useColorModeValue // useColorModeValue is not directly used, but kept if you intend to use it.
} from '@chakra-ui/react';
import { useState } from 'react';
import RecentCases from '../../components/modals/RecentCases';
import CaseModal from '../../components/modals/CaseModal'; //
import GerbIcon from '../../assets/images/gerb.png'
import Marquee from "../../components/modals/Marquee";

const WorksPage = () => {
    const { isOpen, onOpen, onClose } = useDisclosure();
    const [selectedCase, setSelectedCase] = useState(null);

    const cases = [
        {
            id: 1,
            icon:GerbIcon,
            title: 'Հաղթանակ Վերաքննիչ Քաղաքացիական Դատարանում',
            date: '04.06.2024',
            description: 'Մեր վստահորդ ընկերության կողմից ՀՀ սնանկության դատարան էր ներկայացվել 700.000.000 /յոթ հարյուր միլիոն/ ՀՀ դրամ գումարի պահանջի չափը  հաստատելու և գրավի առարկա գույքն արտադատական կարգով իրացնելու դիմումներ։\n' +
                '04.06.2024թ. որոշմամբ ՀՀ սնանկության դատարանը մերժել էր պահանջի գրանցումը և գույքի արտադատական կարգով իրացման թույլտվության տրամադրումը։\n' +
                'Մեր ընկերության փաստաբանների կողմից ՀՀ վերաքննիչ քաղաքացիական դատարան վերաքննիչ բողոք ներկայացվեց, որը բավարարվեց Դատարանի կողմից:\n' +
                'Արդյունքում մեր վստահորդի իրավունքները պատշաճ պաշտպանություն ստացան սնանկության վարույթի շրջանակներում։'
        },
        {
            id: 2,
            icon:GerbIcon,
            title: 'Հաղթանակ ՀՀ Վարչական Դատարանում ',
            date: '15.05.2024',
            description: 'ՀՀ քաղաքաշինության, տեխնիկական և հրդեհային անվտանգության Տեսչական մարմնի ղեկավարը  14.11.2023թ. կայացրել էր թիվ  ՏԾ/Հ/827-2023-Ա վարչական տույժ նշանակելու մասին որոշումը, որով որոշվել էր ---ԱՁ- ին առաջադրել  տուգանք վճարելու պարտավորություն։\n' +
                'Մեր ընկերության փաստաբանների կողմից ՀՀ Վարչական դատարան էր  ներկայացվել վիճարկման հայց, որի արդյունքում թիվ ՏԾ/Հ/827-2023-Ա վարչական տույժ նշանակելու մասին որոշումը անվավեր ճանաչեց։'
        },
        {
            id: 3,
            icon:GerbIcon,
            title: 'Հաղթանակ ՀՀ Վարչական Դատարանում',
            date: '22.03.2024',
            description: 'Մեր վստահորդ Ընկերությանը ՀՀ Պետական եկամուտների կոմիտեն, 23.02.2024թ. թիվ 3225945  Արձանագրության հիման վրա, առաջադրել էր 974.452 ՀՀ դրամի չափով տուգանք վճարելու պարտավորություն։\n' +
                'Մեր ընկերության փաստաբանների կողմից նշված որոշումը վիճարկվեց ՀՀ վարչական դատարանում, որի արդյունքում թիվ 3225945  Արձանագրությունը անվավեր ճանաչվեց։'
        },
        {
            id: 4,
            icon:GerbIcon,
            title: 'Հաղթանակ Երեվան Քաղաքի Առաջին Ատյանի Ընդահնուր Իրավասության Քաղաքացիական Դատարանում ',
            date: '22.03.2024',
            description: 'Մեր վստահորդ ընկերության կողմից, ծառայությունների վճարովի մատուցման պայմանագրի հիման վրա, ծառայություն էր մատուցվել Պատվիրատուին, սակայն վերջինս հրաժարվել էր վճարել մատուցված ծառայության դիմաց։\n' +
                'Մեր ընկերության փաստաբանների կողմից հայցադիմում ներկայացվեց ՀՀ, Երևան քաղաքի առաջին ատյանի ընդհանուր իրավասության քաղաքացիական դատարան, որի արդյունքում Պատասխանողներից բռնագանձվեց՝ 1.486.429 ՀՀ դրամ, որից 1.145.000 ՀՀ դրամ՝ որպես պարտավորության մայր գումար, 341.429 ՀՀ դրամը՝ որպես ՀՀ քաղաքացիսկան օրենսգրքի 411-րդ հոդվածով սահմանված   տոկոսագումար։'
        },
        {
            id: 5,
            icon:GerbIcon,
            title: 'Հաղթանակ ՀՀ Վարչական Դատարանում',
            date: '04.06.2024',
            description: 'ՀՀ քաղաքաշինության, տեխնիկական և հրդեհային անվտանգության Տեսչական մարմնի ղեկավարը 2023թ. փետրվարի 24-ին կայացրել էր թիվ 22008/87-Ա վարչական տույժ նշանակելու մասին որոշումը, որով որոշվել էր «----» ՍՊԸ-ին «Տեխնիկական անվտանգության ապահովման պետական կարգավորման մասին» ՀՀ օրենքի 21-րդ հոդվածի 5-րդ մասի հատկանիշներով ենթարկել վարչական պատասխանատվության՝ վերջինիս նկատմամբ նշանակելով վարչական տույժ՝ տուգանք՝ յուրաքանչյուր ԱՎՕ-ի համար 1.000.000 /մեկ միլոն/ ՀՀ դրամ գումարի չափով, ընդհանուր՝ 3․000․000 /երեք միլիոն/ ՀՀ դրամ գումարի չափով:\n' +
                'Մեր ընկերության փաստաբանների կողմից ՀՀ Վարչական դատարան էր  ներկայացվել վիճարկման հայց, որի արդյունքում ՀՀ Վարչական դատարանը, 18.06.2024թ․ կայացրած վճռով, թիվ 22008/87-Ա վարչական տույժ նշանակելու մասին որոշումը անվավեր ճանաչեց։'
        },
        {
            id: 6,
            icon:GerbIcon,
            title: 'Հաղթանակ ՀՀ Վարչական Դատարանում',
            date: '29.04.2024',
            description: 'Քաղաքացու կողմից Երևանի քաղաքապետարան  դիմում էր  ներկայացվել ՝ ՀՀ, քաղաք Երևան, Դավթաշեն, ** փողոց, թիվ * տանը կից գտնվող ինքնակամ շինությունը և դրանով ծանրաբեռնված հողամասն օրինականացնելու պահանջով։ \n' +
                'Երևանի քաղաքապետարանը   23․05․2023 թվականի թիվ 18/29320-23 պատասխան գրությամբ մերժել էր քաղաքացու խնդրանքն այն հիմնավորմամբ, որ քննարկվող շինությունը գտնվում է կառուցապատման գծից դուրս։ \n' +
                'Մեր Ընկերության փաստաբանների կողմից ՀՀ Վարչական դատարան էր ներկայացվել պարտավորեցման հայց, որի արդյունքում ՀՀ Վարչական դատարանը 19.03.202Նթ. կայացված վճռով պարտավորեցրել է Երևանի քաղաքապետարանին ընդունել բարենպաստ վարչական ակտ՝ Ա․ Ա․-ի դիմումի հիմքով ք. Երևան, Դավթաշեն, * փողոց, թիվ * տանը կից ինքնակամ շինությունն օրինականացնելու վերաբերյալ'
        },
    ];

    const handleCaseClick = (caseItem) => {
        setSelectedCase(caseItem);
        onOpen();
    };

    return (
        <Box>

            <Marquee
                icon={GerbIcon}
                title="Մեր Հաջողված Գործերը"
                subtitle="Մեր իրավաբանական թիմի կողմից իրականացված ամենանշանակալի դատական գործերը"
                bgColor="#1a365d"
                speed={20}

            />


            <Container
                maxW={{ base: "95%", md: "container.lg", xl: "container.xl" }}
                py={{ base: 10, md: 20 }}
            >

                <RecentCases cases={cases} onCaseClick={handleCaseClick} />
            </Container>


            <CaseModal
                isOpen={isOpen}
                onClose={onClose}
                caseData={selectedCase}
            />
        </Box>
    );
};

export default WorksPage;